# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [5]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [7]:
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(series1, series2, series3)

0     1
1     3
2     4
3     2
4     1
     ..
95    3
96    1
97    1
98    1
99    4
Length: 100, dtype: int64 0     3
1     3
2     1
3     1
4     1
     ..
95    2
96    3
97    3
98    3
99    3
Length: 100, dtype: int64 0     22381
1     24577
2     14872
3     22294
4     12886
      ...
95    26789
96    12947
97    14217
98    11162
99    25476
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
houses = pd.concat([series1, series2, series3], axis=1)
houses.head()

   0  1      2
0  1  3  22381
1  3  3  24577
2  4  1  14872
3  2  1  22294
4  1  1  12886

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [10]:
houses.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
houses.head()

   bedrs  bathrs  price_sqr_meter
0      1       3            22381
1      3       3            24577
2      4       1            14872
3      2       1            22294
4      1       1            12886

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [11]:
bigcolumn = pd.concat([series1, series2, series3], axis=0)
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       1
1       3
2       4
3       2
4       1
..    ...
95  26789
96  12947
97  14217
98  11162
99  25476

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [12]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [13]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        1
1        3
2        4
3        2
4        1
..     ...
295  26789
296  12947
297  14217
298  11162
299  25476

[300 rows x 1 columns]